In [1]:
# Import the libraries
import sqlite3
import csv
import numpy as np
import pandas as pd

### a cursor allows you to go through each row of data one by one.
### it comes in handy when you have to  go through each record in a set like updating and deleting data.

In [ ]:
# Create a connection
conn = sqlite3.connect('energyindicators.sqlite')

# Create a cursor object to navigate
cur = conn.cursor()

SQL Basics

Creating Tables

In [3]:
cur.execute('''DROP TABLE graduates''')

In [4]:
# Creating a new table called students
# The fields will be name, graduation year, and school

cur.execute(''' 
CREATE TABLE graduates(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    graduated INTEGER,
    school TEXT
    )
''')

In [5]:
# inserting a record into the table

cur.execute('''
INSERT INTO graduates (name, graduated, school) VALUES ('Shirley Chisholm', 1951, 'Columbia University')''')

conn.commit()

In [ ]:
# Importing mulitple records into the table
# first creating a list of the records I want to add
data = [('Kimberle Crenshaw', 1989, 'Columbia University'),
        ('Barack Obama', 1983, 'Columbia University'),
        ('Mae Jemison', 1981, 'Cornell University School of Medicine'),
        ('Bessie Coleman','NULL' ,'Langston Industrial College'),
        ('Langston Hughes', 1929, 'Lincoln University'),
        ('Maya Angelou', 1944, 'Mission High School'),
        ('Zora Neale Hurston', 1928, 'Columbia University'),
        ('Claudette Colvin','NULL' , 'Booker T Washington High School'),
        ('Martin Luther King Jr', 1948, 'Morehouse College'),
        ('Audre Lorde', 1961, 'Columbia University'),
        ('Ruby Bridges','NULL' , 'Kansas City Business School'),
       ('LaKeta L Kemp', 2024, 'Howard University'),
       ('Remi Des-Ogugua', 2023, 'Agnes Scott College')]

# Adding the the data as new records.
cur.executemany('''
INSERT INTO graduates (name, graduated, school) VALUES (?, ?, ?)''',data)
conn.commit()

In [ ]:
cur.execute('''
SELECT *
FROM graduates''')

cur.fetchall()

[(1, 'Shirley Chisholm', 1951, 'Columbia University'),
 (2, 'Kimberle Crenshaw', 1989, 'Columbia University'),
 (3, 'Barack Obama', 1983, 'Columbia University'),
 (4, 'Mae Jemison', 1981, 'Cornell University School of Medicine'),
 (5, 'Bessie Coleman', 'NULL', 'Langston Industrial College'),
 (6, 'Langston Hughes', 1929, 'Lincoln University'),
 (7, 'Maya Angelou', 1944, 'Mission High School'),
 (8, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (9, 'Claudette Colvin', 'NULL', 'Booker T Washington High School'),
 (10, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (11, 'Audre Lorde', 1961, 'Columbia University'),
 (12, 'Ruby Bridges', 'NULL', 'Kansas City Business School'),
 (13, 'LaKeta L Kemp', 2024, 'Howard University')]

In [9]:
cur.execute('''
SELECT *
FROM graduates
WHERE graduated < 1950 
AND graduated != "NULL"
             ''')

cur.fetchall()

[(6, 'Langston Hughes', 1929, 'Lincoln University'),
 (7, 'Maya Angelou', 1944, 'Mission High School'),
 (8, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (10, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (17, 'Langston Hughes', 1929, 'Lincoln University'),
 (18, 'Maya Angelou', 1944, 'Mission High School'),
 (19, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (21, 'Martin Luther King Jr', 1948, 'Morehouse College'),
 (29, 'Langston Hughes', 1929, 'Lincoln University'),
 (30, 'Maya Angelou', 1944, 'Mission High School'),
 (31, 'Zora Neale Hurston', 1928, 'Columbia University'),
 (33, 'Martin Luther King Jr', 1948, 'Morehouse College')]